# Basic introduction for Pandas library

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
series_pandas = pd.Series([1,3,5,np.nan,6,8])
series_pandas

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
randam =np.random.randn(6,4)
randam

array([[ 0.12951853,  0.26490681,  0.0610096 ,  0.48755159],
       [ 0.4648625 , -1.80350671, -1.06235343,  0.7539561 ],
       [-1.17326517,  0.06111177, -1.9798006 , -0.98155104],
       [-0.34960072, -1.87739932,  0.37685993,  0.10955474],
       [ 0.60639666, -0.12235199,  0.69561581,  0.21387596],
       [-0.34797159, -0.12762088,  1.42540876,  0.01319418]])

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.715412  0.847494  0.619786  1.127269
2013-01-02 -0.263364 -0.818946  1.252042  1.003869
2013-01-03 -0.203696  0.356719  0.277943 -0.321551
2013-01-04 -1.984979  0.377793  1.973838  1.086673
2013-01-05  0.212470 -1.038449 -0.720748 -1.441379
2013-01-06 -0.147470 -0.829563  2.155298 -1.605209

In [17]:
df2 = pd.DataFrame({ 'A' : 1.,'B' : pd.Timestamp('20130102'),'C' : pd.Series(1,index=list(range(4)),dtype='float'), 'D': np.array([3] * 4,dtype='int32'),
'E' : pd.Categorical(["test","train","test","train"]),'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [18]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float64
D             int32
E          category
F            object
dtype: object

In [21]:
df.head()

                   A         B         C         D
2013-01-01 -1.715412  0.847494  0.619786  1.127269
2013-01-02 -0.263364 -0.818946  1.252042  1.003869
2013-01-03 -0.203696  0.356719  0.277943 -0.321551
2013-01-04 -1.984979  0.377793  1.973838  1.086673
2013-01-05  0.212470 -1.038449 -0.720748 -1.441379

In [22]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.984979  0.377793  1.973838  1.086673
2013-01-05  0.212470 -1.038449 -0.720748 -1.441379
2013-01-06 -0.147470 -0.829563  2.155298 -1.605209

In [23]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.683742 -0.184159  0.926360 -0.025055
std    0.922552  0.802740  1.090043  1.281658
min   -1.984979 -1.038449 -0.720748 -1.605209
25%   -1.352400 -0.826909  0.363404 -1.161422
50%   -0.233530 -0.231114  0.935914  0.341159
75%   -0.161526  0.372524  1.793389  1.065972
max    0.212470  0.847494  2.155298  1.127269

In [25]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.715412   -0.263364   -0.203696   -1.984979    0.212470   -0.147470
B    0.847494   -0.818946    0.356719    0.377793   -1.038449   -0.829563
C    0.619786    1.252042    0.277943    1.973838   -0.720748    2.155298
D    1.127269    1.003869   -0.321551    1.086673   -1.441379   -1.605209

In [26]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.127269  0.619786  0.847494 -1.715412
2013-01-02  1.003869  1.252042 -0.818946 -0.263364
2013-01-03 -0.321551  0.277943  0.356719 -0.203696
2013-01-04  1.086673  1.973838  0.377793 -1.984979
2013-01-05 -1.441379 -0.720748 -1.038449  0.212470
2013-01-06 -1.605209  2.155298 -0.829563 -0.147470

In [27]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.212470 -1.038449 -0.720748 -1.441379
2013-01-06 -0.147470 -0.829563  2.155298 -1.605209
2013-01-02 -0.263364 -0.818946  1.252042  1.003869
2013-01-03 -0.203696  0.356719  0.277943 -0.321551
2013-01-04 -1.984979  0.377793  1.973838  1.086673
2013-01-01 -1.715412  0.847494  0.619786  1.127269

In [28]:
df['A']

2013-01-01   -1.715412
2013-01-02   -0.263364
2013-01-03   -0.203696
2013-01-04   -1.984979
2013-01-05    0.212470
2013-01-06   -0.147470
Freq: D, Name: A, dtype: float64

In [29]:
 df[0:3]

                   A         B         C         D
2013-01-01 -1.715412  0.847494  0.619786  1.127269
2013-01-02 -0.263364 -0.818946  1.252042  1.003869
2013-01-03 -0.203696  0.356719  0.277943 -0.321551

In [30]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.263364 -0.818946  1.252042  1.003869
2013-01-03 -0.203696  0.356719  0.277943 -0.321551
2013-01-04 -1.984979  0.377793  1.973838  1.086673

In [31]:
 df.loc[dates[0]]

A   -1.715412
B    0.847494
C    0.619786
D    1.127269
Name: 2013-01-01 00:00:00, dtype: float64

In [32]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.715412  0.847494
2013-01-02 -0.263364 -0.818946
2013-01-03 -0.203696  0.356719
2013-01-04 -1.984979  0.377793
2013-01-05  0.212470 -1.038449
2013-01-06 -0.147470 -0.829563

In [33]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.263364 -0.818946
2013-01-03 -0.203696  0.356719
2013-01-04 -1.984979  0.377793

In [34]:
df.loc['20130102',['A','B']]

A   -0.263364
B   -0.818946
Name: 2013-01-02 00:00:00, dtype: float64

In [35]:
df.loc[dates[0],'A']

-1.7154122186366891

In [36]:
 df.at[dates[0],'A']

-1.7154122186366891

In [37]:
 df.iloc[3]

A   -1.984979
B    0.377793
C    1.973838
D    1.086673
Name: 2013-01-04 00:00:00, dtype: float64

In [40]:
 df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.984979  0.377793
2013-01-05  0.212470 -1.038449

In [41]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.263364  1.252042
2013-01-03 -0.203696  0.277943
2013-01-05  0.212470 -0.720748

In [42]:
 df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.263364 -0.818946  1.252042  1.003869
2013-01-03 -0.203696  0.356719  0.277943 -0.321551

In [43]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.847494  0.619786
2013-01-02 -0.818946  1.252042
2013-01-03  0.356719  0.277943
2013-01-04  0.377793  1.973838
2013-01-05 -1.038449 -0.720748
2013-01-06 -0.829563  2.155298

In [44]:
 df.iloc[1,1]

-0.8189456255143274

In [45]:
df.iat[1,1]

-0.8189456255143274

In [46]:
df[df.A > 0]

                  A         B         C         D
2013-01-05  0.21247 -1.038449 -0.720748 -1.441379

In [47]:
df[df > 0]

                  A         B         C         D
2013-01-01      NaN  0.847494  0.619786  1.127269
2013-01-02      NaN       NaN  1.252042  1.003869
2013-01-03      NaN  0.356719  0.277943       NaN
2013-01-04      NaN  0.377793  1.973838  1.086673
2013-01-05  0.21247       NaN       NaN       NaN
2013-01-06      NaN       NaN  2.155298       NaN

In [48]:
df2 = df.copy()

In [50]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -1.715412  0.847494  0.619786  1.127269    one
2013-01-02 -0.263364 -0.818946  1.252042  1.003869    one
2013-01-03 -0.203696  0.356719  0.277943 -0.321551    two
2013-01-04 -1.984979  0.377793  1.973838  1.086673  three
2013-01-05  0.212470 -1.038449 -0.720748 -1.441379   four
2013-01-06 -0.147470 -0.829563  2.155298 -1.605209  three

In [51]:
 df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.203696  0.356719  0.277943 -0.321551   two
2013-01-05  0.212470 -1.038449 -0.720748 -1.441379  four

In [52]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [53]:
 df.at[dates[0],'A'] = 0

In [54]:
 df.iat[0,1] = 0

In [56]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D
2013-01-01  0.000000  0.000000  0.619786  5
2013-01-02 -0.263364 -0.818946  1.252042  5
2013-01-03 -0.203696  0.356719  0.277943  5
2013-01-04 -1.984979  0.377793  1.973838  5
2013-01-05  0.212470 -1.038449 -0.720748  5
2013-01-06 -0.147470 -0.829563  2.155298  5

In [57]:
 df2 = df.copy()

In [59]:
df2[df2 > 0] = -df2
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.619786 -5
2013-01-02 -0.263364 -0.818946 -1.252042 -5
2013-01-03 -0.203696 -0.356719 -0.277943 -5
2013-01-04 -1.984979 -0.377793 -1.973838 -5
2013-01-05 -0.212470 -1.038449 -0.720748 -5
2013-01-06 -0.147470 -0.829563 -2.155298 -5

In [60]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.619786  5  1.0
2013-01-02 -0.263364 -0.818946  1.252042  5  1.0
2013-01-03 -0.203696  0.356719  0.277943  5  NaN
2013-01-04 -1.984979  0.377793  1.973838  5  NaN

In [61]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.619786  5  1.0
2013-01-02 -0.263364 -0.818946  1.252042  5  1.0

In [62]:
 df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  0.619786  5  1.0
2013-01-02 -0.263364 -0.818946  1.252042  5  1.0
2013-01-03 -0.203696  0.356719  0.277943  5  5.0
2013-01-04 -1.984979  0.377793  1.973838  5  5.0

In [63]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [64]:
 df.mean()

A   -0.397840
B   -0.325408
C    0.926360
D    5.000000
dtype: float64

In [65]:
df.mean(1)

2013-01-01    1.404947
2013-01-02    1.292433
2013-01-03    1.357742
2013-01-04    1.341663
2013-01-05    0.863318
2013-01-06    1.544566
Freq: D, dtype: float64

In [66]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [67]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.203696 -0.643281 -0.722057  4.0
2013-01-04 -4.984979 -2.622207 -1.026162  2.0
2013-01-05 -4.787530 -6.038449 -5.720748  0.0
2013-01-06       NaN       NaN       NaN  NaN

In [68]:
 df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000  0.619786   5
2013-01-02 -0.263364 -0.818946  1.871828  10
2013-01-03 -0.467060 -0.462227  2.149772  15
2013-01-04 -2.452039 -0.084434  4.123609  20
2013-01-05 -2.239569 -1.122884  3.402861  25
2013-01-06 -2.387039 -1.952447  5.558160  30

In [69]:
df.apply(lambda x: x.max() - x.min())

A    2.197449
B    1.416242
C    2.876047
D    0.000000
dtype: float64